Revit 2024 API
FabricationConfiguration.GetInsulationSpecificationAbbreviation Method
 Gets insulation specification abbreviation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string GetInsulationSpecificationAbbreviation(
	int insulationSpecificationId
)
Visual Basic
Public Function GetInsulationSpecificationAbbreviation ( _
	insulationSpecificationId As Integer _
) As String
Visual C++
public:
String^ GetInsulationSpecificationAbbreviation(
	int insulationSpecificationId
)
Parameters
insulationSpecificationId
Type: System.Int32
 The insulation specification identifier.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace